"(Not You?)|Login - Clickable text letting user log in as a different user" = "(Not You?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend Nearby|Title of mini-megaphone inside chat bar." = "1 Friend Nearby";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 day";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 hour";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 minute";

"1d|short indicator that a user was active 1 day ago" = "1d";

"1h|short indicator that a user was active 1 hour ago" = "1h";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "1m Limit: Release to send";

"1m|short indicator that a user was active 1 minute ago" = "1m";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 days";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 hours";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 minutes";

"A new version of Messenger is available.|New version title" = "A new version of Messenger is available.";

"Activation Code|placeholder text for activation code field" = "Activation Code";

"Activation Request Failed|" = "Activation Request Failed";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Active Now (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "Add Favorite";

"Add More People|button for adding people to the conversation" = "Add More People";

"Add More People|title for add members page" = "Add More People";

"Add More People|title for add people page" = "Add More People";

"Add People|button to add members to the message thread" = "Add People";

"Add Photos|Button label for adding photos from the photo library" = "Add Photos";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "Add to Existing Contact";

"Adding...|adding progress text" = "Adding...";

"Advanced Settings|text for advanced settings button" = "Advanced Settings";

"Advanced|title for advanced settings page" = "Advanced";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "Alerts Off Until %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "Alerts Off for 1 Hour";

"Alerts Off|Indicates that alerts are off" = "Alerts Off";

"Alerts On|Indicates that alerts are on" = "Alerts On";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "All notifications are off for 8h.";

"All notifications are off.|Mute warning display on thread list" = "All notifications are off.";

"All|Segment button label for all stickers" = "All";

"Answer|Text for button that accepts a call" = "Answer";

"Archive|Button label that will archive the conversation" = "Archive";

"Archive|Label for archive button when swipe to archive in thread list view" = "Archive";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "Are you sure you want to delete the conversation name?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "Are you sure you want to leave this conversation? You will no longer receive new messages.";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "Are you sure?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "Attach a Photo";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "Attach media";

"Back|Go back to previous screen" = "Back";

"Back|generic nav bar back button" = "Back";

"Background task expired|Error string for app killed in background while message was sending" = "Background task expired";

"Bing Image Search|" = "Bing Image Search";

"Blast to at most %i people at a time.|dialog message for when the user tries to select too many recipients for a blast message. A blast message goes to multiple individual recipients who cannot reply-all." = "Blast to at most %1$i people at a time.";

"Blast|Button for starting a blast (broadcast) message. A blast message goes to multiple individual recipients who cannot reply-all." = "Blast";

"Blast|Title of the blast (broadcast) composer screen. A blast message goes to multiple individual recipients who cannot reply-all." = "Blast";

"Blasts can contain up to %i attachments.|dialog message for when the user tries to add too many (>5) attachments to a message" = "Blasts can contain up to %1$i attachments.";

"Bring messages to life|Title of Media attachment NUX" = "Bring messages to life";

"Broadcast|Button for starting a broadcast message. A broadcast message goes to multiple individual recipients who cannot reply-all." = "Broadcast";

"Broadcast|Title of the broadcast composer screen. A broadcast message goes to multiple individual recipients who cannot reply-all." = "Broadcast";

"Call Ended|End call message in non-error case" = "Call Ended";

"Call Ended|String shown when the call ends" = "Call Ended";

"Call Failed|End call message in error case" = "Call Failed";

"Call friends over your Wi-Fi connection or mobile network. Normal data rates apply.|Warning about data usage" = "Call friends over your Wi-Fi connection or mobile network. Normal data rates apply.";

"Call %@|action sheet option for calling a phone number" = "Call %1$@";

"Call|Call" = "Call";

"Calls are free over Wi-Fi. Standard charges apply for calls over a mobile network.|Alert message that warns users their mobile carrier may charge them for making VOIP calls" = "Calls are free over Wi-Fi. Standard charges apply for calls over a mobile network.";

"Camera|Button label for attaching a photo from the camera" = "Camera";

"Cancel|Title for generic Cancel button." = "Cancel";

"Celebrations|Title of list of friends who have events to celebrate." = "Celebrations";

"Chat with any contact or number on your phone without any costs.|Explanation of why one should use the contact importer" = "Chat with any contact or number on your phone without any costs.";

"Chat|The title of the view showing the buddy list section of the app" = "Chat";

"Choose Friends|Button title for adding friends to the broadcast recipients list." = "Choose Friends";

"Choose Photo|action sheet option for choosing a photo from photo library" = "Choose Photo";

"Clear|prompt to clear all unsent messages" = "Clear";

"Clearing...|Progress text shown while clearing the image for a thread" = "Clearing...";

"Close active chat|Button to close an active chat" = "Close active chat";

"Close|Title of button in navigation bar to close a web page." = "Close";

"Closes settings|Accessibility hint for \"Done\" button, tapping on it will close the settings panel" = "Closes settings";

"Comment|Comment button title" = "Comment";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "Compose message to %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "Compose message to %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "Confirm Phone";

"Connecting|Text shown on call screen while connecting a call" = "Connecting";

"Connection Failed|Alert title when connection failed" = "Connection Failed";

"Connection Lost|End call message in connection lost case" = "Connection Lost";

"Contact Info|AXLabel for button to go from Message to Recipient's contact info." = "Contact Info";

"Contact Info|Title of the canonical thread info page." = "Contact Info";

"Continue and Don't Ask Again|Button label to not ask for permission again before continuing through a zero rating session fence" = "Continue and Don't Ask Again";

"Continue|Button label to continue through zero rating session fence" = "Continue";

"Continue|Login - Login Button Title for Keychain Login" = "Continue";

"Conversation Name|placeholder text in conversation name textfield" = "Conversation Name";

"Copy|Option that pops out after long press on a link/phone no./address in message thread." = "Copy";

"Copy|Title for buttons and menus that let user copy the current text" = "Copy";

"Copy|action sheet option for copying a string to the clipboard" = "Copy";

"Could not add new members. Please try again.|message for failing to add members dialog" = "Could not add new members. Please try again.";

"Could not load sticker store.|Error message for sticker store load failure" = "Could not load sticker store.";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "Could not retrieve availability";

"Countries|Title for country picker" = "Countries";

"Country|Country - Country placeholder text" = "Country";

"Create Group Chat|Label for a button that creates a new group chat" = "Create Group Chat";

"Create Group Chat...|Text on a button to compose a new group message" = "Create Group Chat...";

"Create Group Conversation|button for adding people to the canonical conversation" = "Create Group Conversation";

"Create New Contact|action sheet option for creating a new contact" = "Create New Contact";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "Currently in a call";

"Customize Notification Settings|User education for how to configure conversation alerts" = "Customize Notification Settings";

"Decline|Text for button that declines a call" = "Decline";

"Delete Conversation Name|alert title for deleting conversation name" = "Delete Conversation Name";

"Delete Conversation|Button label that will delete the conversation" = "Delete Conversation";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "Delete Message? It cannot be undone.";

"Delete This Entire Conversation?|Title for the Confirm alert box asking the user if they want to delete a conversation." = "Delete This Entire Conversation?";

"Delete|Button label that will delete the conversation" = "Delete";

"Delete|Button to accept deleting the name of a conversation" = "Delete";

"Delete|Label for archive button when swipe to archive in thread list view" = "Delete";

"Delete|Label for button to delete previous character" = "Delete";

"Delete|Label on button that deletes a thread" = "Delete";

"Delete|button text for deleting a message" = "Delete";

"Delete|button text for removing an unsent message" = "Delete";

"Details|title for message details page" = "Details";

"Discover Who's Nearby|Title of NUX to encourage user to use location services." = "Discover Who's Nearby";

"Don't Delete|Button to decline to delete the name of a conversation" = "Don't Delete";

"Don't Save|Don't save action sheet button" = "Don't Save";

"Done editing message list|Accessibility label for button that ends editing of the messages list" = "Done editing message list";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "Done";

"Double-tap to edit|Accessibility hint for FAVORITES header in Chat friend list" = "Double-tap to edit";

"Download Failed|Title in alert view when downloading a sticker pack has failed" = "Download Failed";

"Download|Accessibility label for download button in sticker store list view" = "Download";

"Download|Button title to download an upgrade" = "Download";

"Download|Label for button to download a sticker pack" = "Download";

"Downloaded|Accessibility label for downloaded icon in sticker store list view" = "Downloaded";

"Downloaded|Label for button to show a sticker pack has been downloaded" = "Downloaded";

"Downloading|Accessibility label for download button in sticker store list view when downloading" = "Downloading";

"Downloading|Label for button to show a sticker pack being downloaded" = "Downloading";

"Drag Down to Hide|Chat head dismiss NUX title" = "Drag Down to Hide";

"Drag here to hide|instructions for user to drag a chat head to hide it" = "Drag here to hide";

"Edit|Edit button/label title for chat divebar" = "Edit";

"Email or phone number|email/phone field placeholder on login screen" = "Email or phone number";

"Empty Feedback|Title for empty feedback warning." = "Empty Feedback";

"Enable|Enable Message Anyone, keep it short, 14 chars max" = "Enable";

"Enter Code|Enter Code page title" = "Enter Code";

"Error|Error title for sticker pack detail view" = "Error";

"Error|error title after failed to load webview" = "Error";

"FREE|Price label for free sticker pack" = "FREE";

"Facebook Is Better With Location|Title of NUX to encourage user to use location services." = "Facebook Is Better With Location";

"Facebook Messenger Login|Accessibility label for header of messenger login view" = "Facebook Messenger Login";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "Facebook User";

"Facebook stores contacts on your behalf and may use them to help others to search for or connect with people, or to generate suggestions for you or others. You can edit this information by tapping the \"i\" button in a conversation, or delete all your contacts in your app settings.|Detailed explanation of the contact sync feature on the Learn More screen" = "Facebook stores contacts on your behalf and may use them to help others to search for or connect with people, or to generate suggestions for you or others. You can edit this information by tapping the \"i\" button in a conversation, or delete all your contacts in your app settings.";

"Facebook will periodically use and store your location.|Explanation to let user know Facebook will periodically use and store his location." = "Facebook will periodically use and store your location.";

"Failed to add members|title for failing to add members dialog" = "Failed to add members";

"Failed to save your settings.|error message after changing thread alert setting." = "Failed to save your settings.";

"Favorites|chat bar favorites header title" = "Favorites";

"Featured|Segment button label for featured stickers" = "Featured";

"Follow these steps to use Facebook's location features.|Explanation to let user know he can turn on location services by following the listed steps." = "Follow these steps to use Facebook's location features.";

"Follow|Title for button allowing users to follow the profile they are currently viewing" = "Follow";

"For more accurate results, go to %@ settings and choose Location Services. Select ON for %@.|Error explanation when location services are unavailable, and user gets better results with them on. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "For more accurate results, go to %1$@ settings and choose Location Services. Select ON for %2$@.";

"For more accurate results, go to %@ settings and tap Privacy, then Location Services. Select ON for %@.|Error explanation when location services are unavailable, and user gets better results with them on. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "For more accurate results, go to %1$@ settings and tap Privacy, then Location Services. Select ON for %2$@.";

"Free Call|Text on button that starts a messenger call" = "Free Call";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "Free Calling Unavailable";

"Friends Nearby|Title of list of friends who are nearby." = "Friends Nearby";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "Friends on Messenger";

"Get Directions|action sheet option for viewing a map" = "Get Directions";

"Get Facebook Messenger|The title for messenger promotion banner" = "Get Facebook Messenger";

"Get Started|Label for a button that creates a new group chat" = "Get Started";

"Get Started|Title for NUX" = "Get Started";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "Give us feedback or report a problem";

"Google Image Search|" = "Google Image Search";

"Group Chat|Title for megaphone section helping users discover group chats" = "Group Chat";

"Group Chats|Title for megaphone section helping users discover group chats" = "Group Chats";

"Group Chats|chat bar header for group conversations" = "Group Chats";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "Group Conversation";

"Group Conversations|Table header for group threads section" = "Group Conversations";

"Group Info|Title of group thread info page." = "Group Info";

"Group Members|Title for section showing members of a group (member count will follow)" = "Group Members";

"Group Messages|Title for megaphone section helping users discover group chats" = "Group Messages";

"Group|Button for starting a new group message." = "Group";

"Have a conversation with a bunch of friends at a time.|Body text for megaphone encourgaging users to try group chats" = "Have a conversation with a bunch of friends at a time.";

"Help|text for help button" = "Help";

"Hold to Talk|The instruction for holding the record button and talk" = "Hold to Talk";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "I'm sure";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "If you enjoy using %1$@, would you mind taking a moment to rate this update? Thanks!";

"Image Search|action sheet option for choosing a photo from image search" = "Image Search";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Include your location";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "Incorrect Confirmation Code.";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "Install Facebook Messenger?";

"Install|Button text to install the Facebook Messenger" = "Install";

"Install|The text on the button for users to install Messenger." = "Install";

"Introducing Chat Heads|Chat head intro NUX title" = "Introducing Chat Heads";

"Invalid Country Code|alert title for invalid country code" = "Invalid Country Code";

"Invalid Phone Number|alert title for invalid phone number" = "Invalid Phone Number";

"Just tap to open and close your messages.|Chat head intro NUX body" = "Just tap to open and close your messages.";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "Keep everyone in the loop";

"Last Updated: %@|last updated date in pull to refresh header" = "Last Updated: %1$@";

"Learn More|Default action text for more info link on the zero rating promotion banner view at the bottom of screen." = "Learn More";

"Learn More|Learn More about Message Anyone, keep it short, 14 chars max" = "Learn More";

"Leave Conversation|leave conversation button" = "Leave Conversation";

"Leave conversation?|confirmation dialog title for leaving a thread" = "Leave conversation?";

"Leave|Button title for leaving a thread" = "Leave";

"Leaving...|Progress text shown while leaving a thread" = "Leaving...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Let people in this conversation know where you are.";

"Licenses|Licenses screen title" = "Licenses";

"Licenses|text for licenses button" = "Licenses";

"Like|Like button title" = "Like";

"Like|Title for generic Like button." = "Like";

"Load Map|Button text for users to load the map location when zero rated." = "Load Map";

"Loading...|Message presented while waiting for content to load." = "Loading...";

"Loading...|Placeholder text while results are loading" = "Loading...";

"Locating You...|Message presented when waiting for an accurate location fix." = "Locating You...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "Location is Disabled";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "Location is off for this conversation";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "Location services are off. Turn on to let people in this conversation know where you are.";

"Location services are on|Title of location NUX when user has enabled location services." = "Location services are on";

"Log In to Facebook|Login - Login Button Title for password login" = "Log In to Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "Logged in as %1$@";

"Login Approval Required|title of login approval dialog" = "Login Approval Required";

"Login Failed|Invalid login alert title" = "Login Failed";

"Logs in as someone else|Accessibility hint for \"Not You?\" link on the login page, letting the user log in as some one else" = "Logs in as someone else";

"Logs in as %@|Accessibility hint for the \"Continue\" button on the login screen, which lets the user log in using the system Facebook account with one tap" = "Logs in as %1$@";

"Logs in to another account|Accessibility hint for \"Switch Account\", which lets users to log out or log in with another account" = "Logs in to another account";

"Mark as Unread|Button label that will mark the thread as unread" = "Mark as Unread";

"Meep|Name for Meep sticker pack" = "Meep";

"Message Anyone|Call to action to use contact importer in divebar" = "Message Anyone";

"Message friends|Accessibility label for button that toggles display of friends list/search" = "Message friends";

"Message|Button for starting a new message." = "Message";

"Message|button to open a composer to send a message to the page" = "Message";

"Messages|Messenger module display name" = "Messages";

"Messages|The title of the message thread list view." = "Messages";

"Messages|Title for messages inbox view" = "Messages";

"Messages|accessibility (voiceover) label for chathead inbox" = "Messages";

"Messages|name of the app with Facebook brand" = "Messages";

"Messenger regularly syncs your contacts to help you reach more people and connect friends|Explanation of the contact sync feature on the Learn More screen" = "Messenger regularly syncs your contacts to help you reach more people and connect friends";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "More Friends (%1$d)";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "More Friends (%1$d)";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "More Online Friends";

"Name is Too Long|alert title for long conversation name" = "Name is Too Long";

"Name this conversation|placeholder text for the prompt to name a conversation" = "Name this conversation";

"Nearby|Nearby people to send a message to" = "Nearby";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "Never miss a message again";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "Never miss a message from your friends again.";

"New Message|Text on a button in messages popover to compose a new message" = "New Message";

"New Message|Title of screen shown when user is composing a new message" = "New Message";

"New version available|Title of alert displayed when new version is available" = "New version available";

"Next|Generic button to move to next item" = "Next";

"Next|button label for moving to the next screen" = "Next";

"No Internet Connection|Warning banner for no network connection" = "No Internet Connection";

"No Message|dialog title for when user tries to send an empty message" = "No Message";

"No Participants|String to display in table cell when no participants are on the thread because everyone has left the conversation" = "No Participants";

"No Participants|String when no participants are on the thread" = "No Participants";

"No Recipients|dialog title for when user tries to send to no recipients" = "No Recipients";

"No Results|Alert title when there are no results from image search." = "No Results";

"No locations shared recently.|message on map view when no location has been shared recently" = "No locations shared recently.";

"No response.|Error reported when no response is received from the server" = "No response.";

"No, Thanks|Label on button for user to decline to rate the app" = "No, Thanks";

"Not Now|Button text to temporarily ignore the installation message" = "Not Now";

"Not Now|Do not enable contact sync button label, 15 char max" = "Not Now";

"Not Now|Not now alert popup button" = "Not Now";

"Not Now|Title of button to not share location for now." = "Not Now";

"Not Now|button label for deferring enabling push notifications" = "Not Now";

"Not now|Button title to decline an upgrade" = "Not now";

"Notifications are turned off for 8 hours|Accessibility announcement for turning off messenger notifications for 8 hours" = "Notifications are turned off for 8 hours";

"Notifications are turned on|Accessibility announcement for turning on messenger notifications" = "Notifications are turned on";

"Notifications for This Conversation|Title for per-thread notification settings" = "Notifications for This Conversation";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "Notifications for this conversation are off.";

"Notifications|Label for enabling/disabling notification" = "Notifications";

"Notifications|Label for enabling/disabling notifications" = "Notifications";

"OK|Title for generic OK button." = "OK";

"Off Until %@|Short string for indicating that alerts are off until X time" = "Off Until %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "Off for 1 Hour";

"Off|Short string for indicating that alerts are off" = "Off";

"On|Short string for indicating that alerts are on" = "On";

"Once you delete your copy of the conversation, it cannot be undone.|Message body for the Confirm alert box asking the user if they want to delete a conversation." = "Once you delete your copy of the conversation, it cannot be undone.";

"Only You|String for describing a thread where you are the only user remaining" = "Only You";

"Open iPhone Settings|One of a sequence of steps instructing user to turn on location services." = "Open iPhone Settings";

"Open in Maps|action sheet option for opening an address in the Maps app" = "Open in Maps";

"Open sticker store|Accessibility label for sticker store tab bar button" = "Open sticker store";

"Other People|Table section header for a list of non-friend search results" = "Other People";

"Password|password field placeholder on login screen" = "Password";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "People in this conversation can see your location on the map.";

"People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "People you add will see all previous messages in this conversation.";

"Phone Number|placeholder text for phone number field" = "Phone Number";

"Pin friends you message most|Label when users have no favorites" = "Pin friends you message most";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "Please check your confirmation code and try again.";

"Please check your network connection and try again.|" = "Please check your network connection and try again.";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "Please check your number and try again.";

"Please check your number and try again.|alert message for invalid phone number" = "Please check your number and try again.";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "Please download the latest version of Facebook Messenger.";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "Please enter a message or attach a photo";

"Please enter a valid country code.|alert message for invalid country code" = "Please enter a valid country code.";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "Please enter the email and password you use to log in to Facebook.";

"Please include a description of your problem.|Message for empty feedback warning." = "Please include a description of your problem.";

"Please rate the quality of your call|Prompt for call quality survey" = "Please rate the quality of your call";

"Please re-login to renew your session.|Error message for expired session" = "Please re-login to renew your session.";

"Please try again|Alert message when there are no results from image search." = "Please try again";

"Please use a shorter conversation name.|alert message for long conversation name" = "Please use a shorter conversation name.";

"Privacy & Terms|text for privacy and terms button" = "Privacy & Terms";

"Pull Chat Heads down to the Ⓧ to hide them.|Chat head dismiss NUX body" = "Pull Chat Heads down to the Ⓧ to hide them.";

"Pull down to refresh...|message for pull down to refresh" = "Pull down to refresh...";

"Push notification alerts are off.|Notice that push notifications are turned off" = "Push notification alerts are off.";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "Push notification alerts are off.";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "Push notification sounds are off.";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "Push notifications are off.";

"Push up to refresh...|message for push up to refresh" = "Push up to refresh...";

"Pusheen|Name for Pusheen sticker pack" = "Pusheen";

"Quickly find your group chats here.|Body text for megaphone encourgaging users to try group chats" = "Quickly find your group chats here.";

"Quickly find your group messages here.|Body text for megaphone encourgaging users to try group chats" = "Quickly find your group messages here.";

"Rate %@|Alert title for asking user to rate this app." = "Rate %1$@";

"Rate %@|Label on button prompting user to rate the app." = "Rate %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "Reach friends wherever they are now — mobile or web.";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "Reach friends wherever they are now";

"Recent Stickers|Accessibility label for recently used stickers" = "Recent Stickers";

"Recent Stickers|Label shown in recent stickers tab when no recent stickers exist." = "Recent Stickers";

"Record Video|action sheet option for recording a video" = "Record Video";

"Record Voice|Button label for attaching an audio clip" = "Record Voice";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "Recorder failed to start";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "Recording cancelled";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "Release to cancel recording";

"Release to refresh...|message for releasing to refresh" = "Release to refresh...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "Remind Me Later";

"Remove Attachment|action sheet option for removing current attachment" = "Remove Attachment";

"Remove Photo|action sheet option for removing chosen photo" = "Remove Photo";

"Remove Photo|action sheet option for removing current attachment" = "Remove Photo";

"Removing...|text for removing progress" = "Removing...";

"Report a Problem|title for give feedback or report bug" = "Report a Problem";

"Resend|Resend - Resend Button Title" = "Resend";

"Retry|generic retry button" = "Retry";

"Ringing|Text shown on call screen while contacting another party" = "Ringing";

"Save Photo|action sheet option to save photo to library" = "Save Photo";

"Save photo as conversation image?|" = "Save photo as conversation image?";

"Save|" = "Save";

"Saving...|Progress text shown while saving a new image for a thread" = "Saving...";

"Saving...|Progress text shown while saving a new name for a thread" = "Saving...";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "Search for More Friends…";

"Search to add favorites|placeholder in edit favorites search bar" = "Search to add favorites";

"Search|placeholder in search bar" = "Search";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "Searching...";

"See Group Chats|Label for a button that creates a new group chat" = "See Group Chats";

"See where friends are hanging out and share your location with them. They won't see exactly where you are.|Description of NUX to encourage user to use location services." = "See where friends are hanging out and share your location with them. They won't see exactly where you are.";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "Seen by Everyone";

"Seen by everyone|Seen state text for when everyone has seen the message." = "Seen by everyone";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "Seen by %1$@ %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "Seen by %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "Seen by %1$@";

"Seen by:|Text for seen state header" = "Seen by:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "Seen %1$@ near %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "Seen %1$@";

"Select country code|select country code text" = "Select country code";

"Send (%i)|Send button with count in parentheses" = "Send (%1$i)";

"Send Failure|dialog title for when a broadcast message fails" = "Send Failure";

"Send in Message|Sharing option" = "Send in Message";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "Send to Phone, Chat and Web";

"Send|Nav bar send button text" = "Send";

"Send|Send button" = "Send";

"Send|text to show in the send button" = "Send";

"Sending...|sending progress text" = "Sending...";

"Sending…|Text used below message bubble to show send is in progress" = "Sending…";

"Sent a message|default notification text for messages with no body text" = "Sent a message";

"Sent from Messenger|indicator that a message was sent from Messenger" = "Sent from Messenger";

"Sent from email|indicator that a message was sent from email" = "Sent from email";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "Sent from mobile";

"Sent from web|indicator that a message was sent sent from web or chat" = "Sent from web";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "Sent from %1$@";

"Sent %@|Text used for showing that a message has been successfully sent to the server. eg. (Published <time>)." = "Sent %1$@";

"Session Expired|Error title for expired session" = "Session Expired";

"Set Facebook to ON|One of a sequence of steps instructing user to turn on location services." = "Set Facebook to ON";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "Settings App > General > Location Services";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "Settings App > Location Services";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "Settings App > Privacy > Location Services";

"Settings|Accessibility label for a gear button that shows settings for chat" = "Settings";

"Settings|Settings alert popup button" = "Settings";

"Settings|title for settings page" = "Settings";

"Share your location to see who.|Subtitle of mini-megaphone inside chat bar. User can see which friends are nearby after sharing his own location." = "Share your location to see who.";

"Share|Share button title" = "Share";

"Shared Photos|Title for section showing photos in a thread (count will follow)" = "Shared Photos";

"Shared a link|text for a link share" = "Shared a link";

"Shared a photo|text for a photo share" = "Shared a photo";

"Shared a video|text for a video share" = "Shared a video";

"Show keyboard|Accessibility label for sticker button in the input field when sticker input is shown" = "Show keyboard";

"Show stickers|Accessibility label for sticker button in the input field when sticker input is not shown" = "Show stickers";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "Sign Up for Facebook";

"Skip|Skip - Skip Button Title" = "Skip";

"Something went wrong. Want to try again?|retry dialog message" = "Something went wrong. Want to try again?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "Sorry, something went wrong";

"Standard Data Charges|Alert title that warns users their mobile carrier may charge them to use this feature" = "Standard Data Charges";

"Standard charges apply when you load map data.|Alert message that warns users their mobile carrier may charge them for loading the map location" = "Standard charges apply when you load map data.";

"Start Group Chats|Call to action for Group Chat NUX slide" = "Start Group Chats";

"Sticker Store|Navigation bar title for sticker store view" = "Sticker Store";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "Stop attaching media";

"Submit|Submit button title" = "Submit";

"Suggestions|Suggested people to send a message to" = "Suggestions";

"Switch Account|text for switching logged in user" = "Switch Account";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "Switch to Wi-Fi to complete your call";

"Sync Contacts|Start contact sync button label, 15 char max" = "Sync Contacts";

"Sync Your Contacts|Title of the Learn More screen for the contact sync feature" = "Sync Your Contacts";

"Tag posts and photos with a location. Plus discover what's happening nearby, even when your phone is in your pocket.|Description of NUX to encourage user to use location services." = "Tag posts and photos with a location. Plus discover what's happening nearby, even when your phone is in your pocket.";

"Take Photo|action sheet option for taking a photo" = "Take Photo";

"Tap General|One of a sequence of steps instructing user to turn on location services." = "Tap General";

"Tap Location Services|One of a sequence of steps instructing user to turn on location services." = "Tap Location Services";

"Tap Privacy|One of a sequence of steps instructing user to turn on location services." = "Tap Privacy";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "Tap \"Try Again\" to send this message.";

"Tap gear to turn on chat|placeholder in search bar when offline" = "Tap gear to turn on chat";

"Tap here to learn about your settings and why Facebook continuously needs your location.|Disclaimer text for continuous location tracking and sharing feature" = "Tap here to learn about your settings and why Facebook continuously needs your location.";

"Tap the + to send photos, add s and record voice messages.|Text for Media attachment NUX" = "Tap the + to send photos, add s and record voice messages.";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "Tap to return to call";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "Tap to turn on location";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "Text messages can't be sent to that number.";

"Text your friends for free.|The detailed info for free messenger promotion" = "Text your friends for free.";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "Text your friends wherever they are - on their phones or on chat.";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "That phone number is not allowed to receive text messages.";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "There was a problem connecting to Facebook. Please check your connection and try again.";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "There was a problem connecting your call. Please connect to Wi-Fi and try again.";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "Tip: Never Miss a Message";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "To accept calls, you need to update to the new version of Messenger.";

"To complete your phone number activation, please enter the activation code|" = "To complete your phone number activation, please enter the activation code";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "To include location with your messages, go to your %1$@.";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "To make calls, you need to update to the new version of Messenger.";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "To turn off alerts for this conversation, go to conversation settings.";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "To turn off location for all your conversations, go to your %1$@.";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications on Messenger" = "To turn on notifications, visit iPhone Settings %1$@ Notifications %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for %@.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "To use this feature, go to your %1$@ settings and choose Location Services. Select ON for %2$@.";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for %@.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "To use this feature, go to your %1$@ settings and tap Privacy, then Location Services. Select ON for %2$@.";

"To|Accessibility label for to field in contact picker" = "To";

"To:|to field in contact picker" = "To:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "Touch and hold to talk.\nRelease to send, or slide off the button to cancel.";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "Try Again";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "Turn Off Chat";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "Turn Off Until 8am";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "Turn Off for 1h";

"Turn Off|Option to turn off alerts" = "Turn Off";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "Turn On Chat";

"Turn On Location Services|Error message title when location services are unavailable." = "Turn On Location Services";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "Turn On Notifications";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "Turn On Notifications";

"Turn On|Option to turn on alerts" = "Turn On";

"Turn On|Turn on alerts" = "Turn On";

"Turn On|button label for deferring enabling push notifications" = "Turn On";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "Turn on Push Notifications";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "Turn on push notifications to find out when new messages arrive.";

"Turns notifications on or off|Accessibility hint for Notification switch in the messenger settings panel, which lets users to turn on/off notifications" = "Turns notifications on or off";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "Typing…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "Unable to Call %1$@";

"Unable to Save Image|retry dialog title for setting thread image" = "Unable to Save Image";

"Unable to Send|Title for send feedback failed warning." = "Unable to Send";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "Unable to add more people to the conversation. Please try again.";

"Unable to name your conversation.|error message after setting conversation name" = "Unable to name your conversation.";

"Unable to remove you right now.|error messages after leaving conversation" = "Unable to remove you right now.";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "Unable to save messaging favorites to Facebook";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "Unable to send message. Retry?";

"Unable to send message.|Alert text for when a message failed to send." = "Unable to send message.";

"Unable to send right now.|error message for failing to send message" = "Unable to send right now.";

"Unpin|button title to remove user from favorites" = "Unpin";

"Update|Get new version now button." = "Update";

"Updating...|updating progress text" = "Updating...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "Upgrade Now";

"Use Messenger for Free|Default title for the zero rating promotion banner view at the bottom of screen." = "Use Messenger for Free";

"View Call|Text show on button that views an incoming call" = "View Call";

"View Missed Call|Text show on button that views an incoming call" = "View Missed Call";

"View Timeline|Button text to go to a user's timeline" = "View Timeline";

"View in Maps|action sheet option for viewing a map" = "View in Maps";

"View|Alert button that takes user to the thread where a message failed to send" = "View";

"We are sorry that the %@ sticker pack has failed to download, please try again later.|Description text shown in alert when downloading a sticker pack has failed" = "We are sorry that the %1$@ sticker pack has failed to download, please try again later.";

"We'll text you a link to confirm your number.|Confirmation information text" = "We'll text you a link to confirm your number.";

"Welcome to Messenger|Title for NUX page" = "Welcome to Messenger";

"Who do you want to message?|Placeholder text in To field when composing a message" = "Who do you want to message?";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "Who would you like to send this message to?";

"Write a blast (sends a separate message to each friend)|Placeholder text for blast message text box which helps explain how blast messages work." = "Write a blast (sends a separate message to each friend)";

"Write a broadcast (sends a separate message to each friend)|Placeholder text for broadcast message text box which helps explain how broadcast messages work." = "Write a broadcast (sends a separate message to each friend)";

"Write a message...|Placeholder text to suggest writing a message" = "Write a message...";

"You can call %@ over Wi-Fi. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if wifi is required" = "You can call %1$@ over Wi-Fi. Please turn on Wi-Fi in your phone settings.";

"You can manage your data in your privacy settings.|Explanation to let user know he can manage his data in privacy settings." = "You can manage your data in your privacy settings.";

"You missed a call from %@|Message notifying user of a missed call from Friend" = "You missed a call from %1$@";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "You will get an SMS or email shortly with a code to use for logging in.";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "You won't find out when you've received a message.";

"You|String for you, the user" = "You";

"You're about to leave Messenger. Standard data charges may apply.|Alert message that warns users their mobile carrier may charge them due to redirect out of Messenger" = "You're about to leave Messenger. Standard data charges may apply.";

"Your Stickers|Segment button label for downloaded stickers" = "Your Stickers";

"Your friend can't receive calls right now|Text informing user that call button is disabled because his or her friend is not available" = "Your friend can't receive calls right now";

"Your friend is nearby at a coffee shop.|Example of what user can know after sharing location." = "Your friend is nearby at a coffee shop.";

"Your friend recommended a restaurant nearby.|Example of what user can know after sharing location." = "Your friend recommended a restaurant nearby.";

"Your friend took a photo nearby.|Example of what user can know after sharing location." = "Your friend took a photo nearby.";

"Your message failed to send to one or more of the recipients.|dialog content for when a broadcast message fails." = "Your message failed to send to one or more of the recipients.";

"Your message failed to send to one or more of the recipients.\n\n%@|dialog content for when a broadcast message fails, appended with a localized server error message. The server error message should appear on its own line and will generally be its own sentence, such as 'The internet connection appears to be offline.'" = "Your message failed to send to one or more of the recipients.\n\n%1$@";

"Your message was not sent.|text shown when a message failed to send" = "Your message was not sent.";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "Your messages were not sent.";

"[[content]] [[cta]]|The i18n format for zero rating banner" = "[[content]] [[cta]]";

"·|Dot separator between title and count label" = "·";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "…";

"active 1d ago|indicator that a user was active 1 day ago" = "active 1d ago";

"active 1h ago|indicator that a user was active 1 hour ago" = "active 1h ago";

"active 1m ago|indicator that a user was active 1 minute ago" = "active 1m ago";

"active now|indicator that a user is currently active, on web or mobile" = "active now";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "active on mobile %1$@ ago";

"active on mobile|presences status for being active on mobile" = "active on mobile";

"active %id ago|indicator that a user was active 2+ days ago" = "active %1$id ago";

"active %ih ago|indicator that a user was active 2+ hours ago" = "active %1$ih ago";

"active %im ago|indicator that a user was active 2+ minute ago" = "active %1$im ago";

"active %@ ago|presences status for being active a relative time ago" = "active %1$@ ago";

"error|A short message for audio play error" = "error";

"is calling|text below the caller's name when they are calling" = "is calling";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "is typing…";

"on mobile|presences status for being available on mobile" = "on mobile";

"online %@ ago|presences status for being online on the web a relative time ago" = "online %1$@ ago";

"online|presences status for being online on the web" = "online";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "typing…";

"%d more friends nearby...|Additional nearby friend results available to show" = "%1$d more friends nearby...";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d of %2$d";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i days";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i hours";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i minutes";

"%i people found, %i matched|Explanation of how many contacts have been imported" = "%1$i people found, %2$i matched";

"%id|short indicator that a user was active 2+ days ago" = "%1$id";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$ih";

"%im|short indicator that a user was active 2+ minute ago" = "%1$im";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@  •  %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ and %2$@ use Facebook Messenger";

"%@ and %@|String for two user names who are participants on a thread" = "%1$@ and %2$@";

"%@ hundred-million|Shortened number whose value is larger than 100,000,000. Only used in languages that have a word for 'hundred million' but not for 'billion'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ hundred-million";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ is calling";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ is in another call";

"%@ is nearby at a coffee shop.|Example of what user can know after sharing location. E.g. Mark is nearby at a coffee shop." = "%1$@ is nearby at a coffee shop.";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ is not available";

"%@ is on messenger|Accessibility label for a profile photo showing the user that one of their friends uses Messenger" = "%1$@ is on messenger";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ is typing…";

"%@ recommended a restaurant nearby.|Example of what user can know after sharing location. E.g. Linda recommended a restaurant nearby." = "%1$@ recommended a restaurant nearby.";

"%@ said %@|Accessibility label for a message, will be announced to blind users. First placeholder is for sender name, second placeholder is for the message he/she sent." = "%1$@ said %2$@";

"%@ ten-thousand|Shortened number whose value is between 10,000 and 99,999,999. Only used for languages that have a word for 'ten thousand' but not for 'million'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ ten-thousand";

"%@ took a photo nearby.|Example of what user can know after sharing location. E.g. Anna took a photo nearby." = "%1$@ took a photo nearby.";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ tried to call you";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ uses Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %d new messages|new messages input format" = "%1$@, %2$d new messages";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, %2$i more";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ and %3$@ use Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ and 1 other friend use Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ and %4$i other friends use Messenger";

"%@: %@|Localized contact label: phone number (note colon separator)" = "%1$@: %2$@";

"%@B|Shortened number whose value is larger than 1,000,000,000. B stands for 'billion'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@B";

"%@K|Shortened number whose value is between 1,000 and 999,999. K stands for 'thousand''. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@K";

"%@M|Shortened number whose value is between 1,000,000 and 999,999,999. M stands for 'mega' or 'million'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@M";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@…";

"%u Friends Nearby|Title of mini-megaphone inside chat bar. E.g. 5 Friends Nearby" = "%1$u Friends Nearby";

"%u of your friends are sharing their location with you.|Message to let user know how many of his friends are sharing location." = "%1$u of your friends are sharing their location with you.";

"%u photo attached|Accessiblity text for a single photo" = "%1$u photo attached";

"%u photos attached|Accessibility text for a photo set" = "%1$u photos attached";

